DMSurya/Nisense_Surya/NiSense-main/src/sensors/max32664_update.c
/**
 * @file max32664_update.c
 * @brief MAX32664 firmware update implementation
 * 
 * Bootloader protocol (per MAX32664 User Guide Table 9):
 * - Enter bootloader: Family 0x01, Index 0x00, Data 0x08
 * - Set IV:           Family 0x80, Index 0x00, Data [11 bytes from .msbl @ 0x28-0x32]
 * - Set Auth:         Family 0x80, Index 0x01, Data [16 bytes from .msbl @ 0x34-0x43]
 * - Set num pages:    Family 0x80, Index 0x02, Data [0x00, num_pages]  (byte 0x44)
 * - Erase app:        Family 0x80, Index 0x03  (CMD_DELAY = 1400ms)
 * - Write page:       Family 0x80, Index 0x04, Data [8192 bytes + 16-byte CRC from .msbl]  (CMD_DELAY = 680ms)
 * - Flash app:        Family 0x80, Index 0x06  (optional finalize; see Kconfig)
 * - Exit bootloader:  Family 0x01, Index 0x00, Data 0x00
 *
 * Bootloader latch (ADI UG p.17 / Table 9):
 *   After GPIO RSTN/MFIO entry, send 0x01 0x00 0x08 within ~780 ms of BL
 *   readiness or a valid app image will auto-jump out of bootloader.
 *
 * Page Write Protocol:
 * Each page write transaction:
 *   [0x80, 0x04, <8192 bytes page data>, <16 bytes CRC from .msbl file>]
 * Total: 8210 bytes per page.
 *
 * The 16-byte CRC is read directly from the .msbl file (it follows each
 * 8192-byte page block in the file).  Do NOT compute it independently.
 * Wait 680ms after sending before reading status (per MAX32664 datasheet).
 *
 * Stability guardrails (activated before flashing):
 * - health_sched / PPG / accel feeder quiesced
 * - PM idle disabled
 *
 * Memory requirements:
 * - TX buffer: 8198 bytes (heap-allocated)
 * Total: ~8KB heap
 */

#include "max32664_update.h"
#include <app_data.h>
#include <zephyr/drivers/sensor/max32664.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/kernel.h>
#include <zephyr/pm/policy.h>
#include <string.h>
#include <stdlib.h>

#if defined(CONFIG_APP_HEALTH_SCHED)
#include "health_sched.h"
#endif
#if defined(CONFIG_PPG_ALGO)
#include <zephyr/subsys/ppg_algo/ppg_algo.h>
#endif


LOG_MODULE_REGISTER(max32664_update, CONFIG_SENSOR_LOG_LEVEL);

/* Bootloader commands (Family 0x80 in bootloader mode)
 * Index table per MAX32664 User Guide Table 9:
 *   0x00  Set Initialization Vector     (11 bytes from .msbl @ 0x28-0x32)
 *   0x01  Set Authentication bytes      (16 bytes from .msbl @ 0x34-0x43)
 *   0x02  Set Number of Pages           (2-byte big-endian: [0x00, num_pages])
 *   0x03  Erase application flash       (CMD_DELAY = 1400ms)
 *   0x04  Write page                    (8192 data + 16 CRC bytes, CMD_DELAY = 680ms)
 *   0x06  Flash application             (finalize flashed image)
 *   0x08  Get/set CRC
 */
#define BOOTLOADER_SET_IV       		0x00  	/* Set Initialization Vector (11 bytes from .msbl @ 0x28) */
#define BOOTLOADER_SET_AUTH     		0x01  	/* Set Authentication bytes (16 bytes from .msbl @ 0x34) */
#define BOOTLOADER_SET_NUM_PAGES		0x02  	/* Set number of pages */
#define BOOTLOADER_ERASE_APP    		0x03  	/* Erase application flash (CMD_DELAY = 1400ms) */
#define BOOTLOADER_WRITE_PAGE   		0x04  	/* Write page data (CMD_DELAY = 680ms) */
#define BOOTLOADER_FLASH_APP    		0x06  	/* Finalize flashed image */
#define BOOTLOADER_CRC          		0x08  	/* Get/set CRC */

#define FAMILY_CONFIG           		0x01  	/* Configuration family (mode changes) */
#define FAMILY_HUB_STATUS       		0x00  	/* Hub status read */
#define FAMILY_OUTPUT_MODE      		0x02  	/* Output/operating mode read */
#define FAMILY_BOOTLOADER       		0x80  	/* Bootloader family (flash operations) */
#define FAMILY_BOOTLOADER_INFO  		0x81  	/* Bootloader version / page size */
#define FAMILY_IDENTITY         		0xFF  	/* Device identity / firmware version */

/* Index bytes - FAMILY_CONFIG (0x01) */	
#define CONFIG_IDX_OP_MODE      		0x00  	/* Operating mode */

/* Index bytes - FAMILY_OUTPUT_MODE (0x02) */	
#define OUTPUT_MODE_IDX         		0x00  	/* Read current operating mode */

/* Index bytes - FAMILY_HUB_STATUS (0x00) */	
#define HUB_STATUS_IDX          		0x00  	/* Read hub status byte */

/* Index bytes - FAMILY_BOOTLOADER_INFO (0x81) */
#define BL_INFO_IDX_VERSION     		0x00  	/* Bootloader version */
#define BL_INFO_IDX_PAGE_SIZE   		0x01  	/* Bootloader page size */

/* Index bytes - FAMILY_IDENTITY (0xFF) */	
#define IDENTITY_IDX_MCU_TYPE   		0x00  	/* MCU type */
#define IDENTITY_IDX_FW_VERSION 		0x03  	/* Application firmware version */

/* Operating mode data values (used with CONFIG_IDX_OP_MODE) */
#define OP_MODE_APPLICATION     		0x00  	/* Enter application mode */
#define OP_MODE_BOOTLOADER      		0x08  	/* Enter bootloader mode */

/* Status byte values returned in every MAX32664 response (SS_STATUS, OEM SHComm.h) */
#define SS_SUCCESS              		0x00  	/* No error */
#define SS_ERR_COMMAND          		0x01  	/* Unrecognised command */
#define SS_ERR_UNAVAILABLE      		0x02  	/* Command not available in current mode */
#define SS_ERR_DATA_FORMAT      		0x03  	/* Bad data format */
#define SS_ERR_INPUT_VALUE      		0x04  	/* Invalid input value */
#define SS_ERR_BTLDR_GENERAL    		0x80  	/* Bootloader general error */
#define SS_ERR_BTLDR_CHECKSUM   		0x81  	/* Bootloader CRC mismatch — bad .msbl file */
#define SS_ERR_TRY_AGAIN        		0xFE  	/* Bootloader busy — retry after delay */
#define SS_ERR_UNKNOWN          		0xFF  	/* Unknown error */

/* MAX32664 page size (from datasheet) */	
#define MAX32664_PAGE_SIZE     			8192  	/* 8KB per page */
#define MAX32664_MAX_PAGES     			128   	/* Max pages in application area */

/* MSBL file format constants
 * File structure:
 *   [0x00-0x4B]  76-byte header
 *   [0x4C-0x205B]  Page 1: 8192 data + 16 checksum = 8208 bytes
 *   [0x205C-0x406B]  Page 2: 8192 data + 16 checksum = 8208 bytes
 *   ... etc
 */
#define MSBL_HEADER_SIZE        		0x4C  	/* Header size: 76 bytes (0x00-0x4B) */
#define MSBL_PAGE_DATA_SIZE     		8192  	/* Pure data size per page */
#define MSBL_PAGE_CHECKSUM_SIZE 		16    	/* Checksum bytes per page */
#define MSBL_PAGE_SIZE          		8208  	/* Page size in .msbl file (8192 + 16 checksum) */
#define MSBL_OFFSET_IV          		0x28  	/* Initialization Vector offset (11 bytes) */
#define MSBL_OFFSET_AUTH        		0x34  	/* Authentication bytes offset (16 bytes) */
#define MSBL_OFFSET_NUM_PAGES   		0x44  	/* Number of pages offset (1 byte) */

/* Page write timing settings */
#define INTER_PAGE_DELAY_MS     		15    	/* Delay after successful page write */
#define PAGE_FLASH_DELAY_MS     		CONFIG_MAX32664_UPDATE_PAGE_FLASH_DELAY_MS
#define BOOTLOADER_BUSY_RETRIES         CONFIG_MAX32664_UPDATE_PAGE_WRITE_RETRIES
#define BOOTLOADER_BUSY_RETRY_DELAY_MS  120
#define BOOTLOADER_BUSY_POLL_COUNT      20
#define BOOTLOADER_BUSY_POLL_DELAY_MS   50

/* Page write buffer layout:
 *   [0..1]          2-byte command header   (set by write_page_to_bootloader)
 *   [2..8193]    8192-byte page data        (pre-filled by caller from .msbl)
 *   [8194..8209]   16-byte CRC              (read from .msbl file by caller)
 * Total: 8210 bytes
 */
#define PAGE_TX_TOTAL  (2 + MAX32664_PAGE_SIZE + 16)  /* 8210 bytes */

