DMSurya/Nisense_Surya/NiSense-main/src/sensors/max32664_update.c
#if defined(CONFIG_MAX32664_UPDATE_CHUNKED_WRITE)
#define MAX32664_CHUNK_SIZE  CONFIG_MAX32664_UPDATE_CHUNK_SIZE
#endif

/* Return human-readable name for a status byte (for LOG_ERR calls) */
static const char *ss_status_str(uint8_t status)
{
	switch (status) {
	case SS_SUCCESS:            return "SUCCESS";
	case SS_ERR_COMMAND:        return "ERR_COMMAND";
	case SS_ERR_UNAVAILABLE:    return "ERR_UNAVAILABLE";
	case SS_ERR_DATA_FORMAT:    return "ERR_DATA_FORMAT";
	case SS_ERR_INPUT_VALUE:    return "ERR_INPUT_VALUE";
	case SS_ERR_BTLDR_GENERAL:  return "ERR_BTLDR_GENERAL";
	case SS_ERR_BTLDR_CHECKSUM: return "ERR_BTLDR_CHECKSUM (bad CRC in .msbl)";
	case SS_ERR_TRY_AGAIN:      return "ERR_TRY_AGAIN (bootloader busy)";
	case SS_ERR_UNKNOWN:        return "ERR_UNKNOWN";
	default:                    return "UNRECOGNISED";
	}
}

/* ----- Stability Guardrails State ----- */
struct update_guardrails_state {
	bool pm_was_enabled;
	bool auto_was_enabled;
	bool feeder_was_running;
};

/**
 * @brief Pause schedulers / feeder that may contend for the hub I2C bus.
 */
static void activate_update_guardrails(struct update_guardrails_state *state,
				      const struct device *dev)
{
	LOG_INF("=== Activating stability guardrails ===");

	state->auto_was_enabled = false;
	state->feeder_was_running = max32664_accel_feeder_is_running();

#if defined(CONFIG_APP_HEALTH_SCHED)
	state->auto_was_enabled = health_sched_auto_enabled();
	if (state->auto_was_enabled) {
		health_sched_set_auto_enabled(false);
		LOG_INF("health_sched auto disabled for update");
	}
	if (health_sched_is_busy()) {
		int cret = health_sched_cancel_cycle();

		LOG_INF("health_sched cycle cancel: %d", cret);
	}
#endif

#if defined(CONFIG_PPG_ALGO)
	if (ppg_algo_is_measuring() || ppg_algo_is_finalizing()) {
		int pret = ppg_algo_stop_measurement();

		LOG_INF("ppg_algo stop for update: %d", pret);
	}
#endif

	(void)max32664_accel_feeder_stop(dev);
	LOG_INF("accel feeder stop (was_running=%d)", state->feeder_was_running);
	/* One feeder period so an in-flight tick finishes before BL entry. */
	k_msleep(50);

#if defined(CONFIG_PM)
	state->pm_was_enabled = true;
	LOG_INF("Disabling PM idle...");
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
#else
	state->pm_was_enabled = false;
#endif

	LOG_INF("Guardrails active - ready for firmware surgery");
}

static void deactivate_update_guardrails(const struct update_guardrails_state *state)
{
	LOG_INF("=== Deactivating stability guardrails ===");

#if defined(CONFIG_PM)
	if (state->pm_was_enabled) {
		LOG_DBG("Re-enabling PM idle...");
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	}
#endif

#if defined(CONFIG_APP_HEALTH_SCHED)
	if (state->auto_was_enabled) {
		health_sched_set_auto_enabled(true);
		LOG_INF("health_sched auto restored");
	}
#endif
	/* Do not auto-restart feeder — next PPG/RAW start owns that. */

	LOG_INF("Guardrails deactivated - normal operation restored");
}

/* Firmware info extracted from .msbl file */
struct max32664_firmware_info {
	uint8_t num_pages;          /* Number of pages in firmware */
	uint8_t iv_bytes[11];       /* Initialization Vector */
	uint8_t auth_bytes[16];     /* Authentication bytes */
	uint8_t ver_major;          /* New firmware version (parsed from filename) */
	uint8_t ver_minor;
	uint8_t ver_patch;
};

/* I2C helper to send bootloader commands */
static int bootloader_i2c_command(const struct device *dev,
				  uint8_t family, uint8_t index,
				  const uint8_t *data, size_t data_len,
				  uint8_t *response, size_t response_len,	/* response_len always status + data*/
				  uint32_t delay_ms)
{
	struct max32664_bootloader_io io;
	const struct i2c_dt_spec *bus;
	uint8_t tx_buf[256];
	uint8_t rx_buf[256];
	int ret;

	ret = max32664_get_bootloader_io(dev, &io);
	if (ret) {
		LOG_ERR("Failed to get MAX32664 transport interface: %d", ret);
		return ret;
	}
	bus = &io.bus;
	
	LOG_INF("Command: Family=0x%02X, Index=0x%02X", family, index);

	if (data_len + 2 > sizeof(tx_buf)) {
		return -EINVAL;
	}
	
	/* Build command: [family, index, ...data] */
	tx_buf[0] = family;
	tx_buf[1] = index;
	if (data && data_len > 0) {
		memcpy(&tx_buf[2], data, data_len);
	}
	
	/* Log TX data */
	LOG_INF("  TX [%zu bytes]: %02X %02X ...", 2 + data_len, tx_buf[0], tx_buf[1]);
	if (data_len > 0 && data_len <= 32) {
		LOG_HEXDUMP_INF(tx_buf, 2 + data_len, "  TX full:");
	}

	/* Hold hub bus lock across write + delay + read (+ busy polls).
	 * Soft-recursive if caller already session-locked the update. */
	max32664_bus_lock(dev);
	
	/* Send command */
	ret = i2c_write_dt(bus, tx_buf, 2 + data_len);
	if (ret) {
		LOG_ERR("  I2C write failed: %d", ret);
		goto out_unlock;
	}
	
	/* Wait for processing */
	k_msleep(delay_ms);
	
	/* Read response if requested */
	if (response && response_len > 0) {
		ret = i2c_read_dt(bus, rx_buf, response_len);
		if (ret) {
			LOG_ERR("  I2C read failed: %d", ret);
			goto out_unlock;
		}
		
		/* Log RX data */
		LOG_INF("  RX [%zu bytes]: status=0x%02X", response_len, rx_buf[0]);
		if (response_len <= 16) {
			LOG_HEXDUMP_INF(rx_buf, response_len, "  RX full:");
		}
		
		/* Check status byte.
		 * If busy (0xFE), poll additional read-only responses before returning.
		 * Some MAX32664 bootloaders complete the command asynchronously and
		 * expect status polling rather than immediate command re-send. */
		if (rx_buf[0] == SS_ERR_TRY_AGAIN) {
			bool ready = false;

			for (int poll = 0; poll < BOOTLOADER_BUSY_POLL_COUNT; poll++) {
				k_msleep(BOOTLOADER_BUSY_POLL_DELAY_MS);

				ret = i2c_read_dt(bus, rx_buf, response_len);
				if (ret) {
					LOG_ERR("  I2C read poll failed: %d", ret);
					goto out_unlock;
				}

				if (rx_buf[0] == SS_SUCCESS) {
					LOG_DBG("  Bootloader ready after %d poll(s)", poll + 1);
					ready = true;
					break;
				}

				if (rx_buf[0] != SS_ERR_TRY_AGAIN) {
					LOG_ERR("  Command failed after busy poll: 0x%02x (%s)",
						rx_buf[0], ss_status_str(rx_buf[0]));
					ret = -EIO;
					goto out_unlock;
				}
			}

			if (!ready) {
				LOG_DBG("  Bootloader busy (0xFE) — caller should retry");
				ret = -EAGAIN;
				goto out_unlock;
			}
		}
		if (rx_buf[0] != SS_SUCCESS) {
			LOG_ERR("  Command failed: 0x%02x (%s)", rx_buf[0], ss_status_str(rx_buf[0]));
			ret = -EIO;
			goto out_unlock;
		}
		
