DMSurya/Nisense_Surya/NiSense-main/src/sensors/max32664_update.c
		/* Copy response data (skip status byte) */
		memcpy(response, &rx_buf[1], response_len - 1);
	}

	ret = 0;

out_unlock:
	max32664_bus_unlock(dev);
	return ret;
}

/* Retry wrapper for commands that may see SS_ERR_TRY_AGAIN (0xFE)
 * immediately after bootloader entry or during flash operations. */
static int bootloader_i2c_command_with_retry(const struct device *dev,
					     uint8_t family, uint8_t index,
					     const uint8_t *data, size_t data_len,
					     uint8_t *response, size_t response_len,
					     uint32_t delay_ms,
					     uint8_t retries,
					     uint32_t retry_delay_ms,
					     const char *op_name)
{
	int ret;

	for (uint8_t attempt = 0; attempt <= retries; attempt++) {
		ret = bootloader_i2c_command(dev, family, index, data, data_len,
						    response, response_len, delay_ms);
		if (ret != -EAGAIN) {
			return ret;
		}

		if (attempt == retries) {
			LOG_ERR("%s: bootloader busy timeout after %u retries",
				op_name ? op_name : "Command", retries);
			return -ETIMEDOUT;
		}

		LOG_WRN("%s: bootloader busy (0xFE), retry %u/%u in %u ms",
			op_name ? op_name : "Command",
			attempt + 1, retries, retry_delay_ms);
		k_msleep(retry_delay_ms);
	}

	return -ETIMEDOUT;
}

/**
 * @brief Write a single page to MAX32664 bootloader
 * 
 * Protocol: [0x80, 0x04, <8192 bytes page data>, <16 bytes CRC from .msbl>]
 * followed by a status read after PAGE_FLASH_DELAY_MS (680ms).
 * 
 * The 16-byte CRC MUST be read from the .msbl file — it is NOT computed here.
 * tx_buf[2..8193] and tx_buf[8194..8209] must already be filled by the caller.
 * 
 * @param dev MAX32664 device handle
 * @param tx_buf Pre-allocated buffer (PAGE_TX_TOTAL = 8210 bytes):
 *               [0-1]:       Command header  (0x80, 0x04 - set by this function)
 *               [2..8193]:   8192-byte page data (pre-filled by caller from .msbl)
 *               [8194..8209]: 16-byte CRC    (pre-filled by caller from .msbl)
 * @return 0 on success, negative errno on failure
 *
 * Write path selected at compile time:
 *   CONFIG_MAX32664_UPDATE_CHUNKED_WRITE=y (default)
 *     -> Multiple i2c_write() calls of CHUNK_SIZE bytes each.
 *        Each call issues START + data + STOP.  The bootloader buffers
 *        incoming data across transactions.
 *   CONFIG_MAX32664_UPDATE_CHUNKED_WRITE=n
 *     -> Single i2c_write() for the full 8210-byte page.
 */
static int write_page_to_bootloader(const struct device *dev, uint8_t *tx_buf)
{
	struct max32664_bootloader_io io;
	const struct i2c_dt_spec *bus;
	int ret;
	uint32_t start_time, elapsed_ms;

	ret = max32664_get_bootloader_io(dev, &io);
	if (ret) {
		LOG_ERR("Failed to get MAX32664 transport interface: %d", ret);
		return ret;
	}
	bus = &io.bus;

	start_time = k_uptime_get_32();

	/* Set command header */
	tx_buf[0] = FAMILY_BOOTLOADER;       /* 0x80 */
	tx_buf[1] = BOOTLOADER_WRITE_PAGE;   /* 0x04 */

	/* tx_buf[2..8193] = page data    (pre-filled by caller from .msbl)
	 * tx_buf[8194..8209] = 16B CRC   (pre-filled by caller from .msbl)
	 * No checksum computation needed - CRC comes directly from the file. */

	/* Keep chunked/single-shot page traffic exclusive of feeder/sampling. */
	max32664_bus_lock(dev);

#if defined(CONFIG_MAX32664_UPDATE_CHUNKED_WRITE)
	/* Chunked path: stream full PAGE_TX_TOTAL (header + data + 16B CRC = 8210B)
	 * in CHUNK_SIZE chunks.  Each chunk is a separate i2c_write() call. */
	{
		uint8_t *ptr = tx_buf;
		size_t remaining = PAGE_TX_TOTAL;
		int chunk_num = 0;
#if 1
		int total_chunks = (int)DIV_ROUND_UP(PAGE_TX_TOTAL, MAX32664_CHUNK_SIZE);
		LOG_INF("  Chunked write: %d B/chunk, %d chunks, %d B total",
			MAX32664_CHUNK_SIZE, total_chunks, PAGE_TX_TOTAL);
#endif
		ret = 0;
		while (remaining > 0) {
			size_t chunk = MIN(remaining, (size_t)MAX32664_CHUNK_SIZE);
			size_t offset = (size_t)(ptr - tx_buf);
#if 1
			LOG_INF("  Chunk %d/%d: offset=%zu len=%zu hdr=[%02X %02X %02X %02X]",
				chunk_num + 1, total_chunks,
				offset, chunk,
				ptr[0],
				chunk > 1 ? ptr[1] : 0,
				chunk > 2 ? ptr[2] : 0,
				chunk > 3 ? ptr[3] : 0);
#endif
			ret = i2c_write_dt(bus, ptr, (uint32_t)chunk);
			if (ret) {
				LOG_ERR("  Chunk %d FAILED: %d (offset=%zu)", chunk_num + 1, ret, offset);
				break;
			}
#if 1
			LOG_INF("  Chunk %d OK", chunk_num + 1);
#endif
			ptr       += chunk;
			remaining -= chunk;
			chunk_num++;
		}
	}
#else
	/* Single-shot: one i2c_write() for the full 8210-byte page.
	 * At correct 100 kHz bus speed this takes ~738 ms.
	 * Prerequisite: I2C1 must have pull-ups on the nRF side of the PCA9306
	 * level shifter (either external 4.7 kΩ or internal via bias-pull-up in
	 * pinctrl), otherwise large transfers are throttled to ~0.78 kHz. */
	LOG_DBG("  Single-shot write: %d B", PAGE_TX_TOTAL);
	ret = i2c_write_dt(bus, tx_buf, PAGE_TX_TOTAL);
#endif

	if (ret) {
		LOG_ERR("  Page write failed: %d", ret);
		max32664_bus_unlock(dev);
		return ret;
	}
	
	/* Wait for bootloader to begin flash programming */
	k_msleep(PAGE_FLASH_DELAY_MS);
	max32664_bus_unlock(dev);

	/* Poll page write status via the standard command helper.
	 * bootloader_i2c_command returns -EAGAIN when the bootloader responds 0xFE
	 * (still programming flash) — retry with 200ms back-off.
	 * Per OEM reference: SS_DEFAULT_RETRIES = 4. */
	{
		uint8_t hub_status;
		int retries = CONFIG_MAX32664_UPDATE_PAGE_WRITE_RETRIES;

		do {
			ret = bootloader_i2c_command(dev, FAMILY_HUB_STATUS, HUB_STATUS_IDX,
						     NULL, 0, &hub_status, 2, 10);
			if (ret == 0) {
				LOG_DBG("  Hub status after page write: 0x%02X", hub_status);
				break;  /* Page programmed OK */
			} else if (ret == -EAGAIN && retries-- > 0) {
				LOG_DBG("  Bootloader busy (0xFE), retrying (%d left)...", retries);
				k_msleep(200);
			} else if (ret == -EAGAIN) {
				LOG_ERR("  Page write timed out after %d retries",
					CONFIG_MAX32664_UPDATE_PAGE_WRITE_RETRIES);
				return -ETIMEDOUT;
			} else {
				return ret;
			}
		} while (true);
	}

	elapsed_ms = k_uptime_get_32() - start_time;
	LOG_DBG("  Page write complete in %u ms", elapsed_ms);

	/* Inter-page delay */
	k_msleep(INTER_PAGE_DELAY_MS);

