DMSurya/Nisense_Surya/NiSense-main/src/sensors/max32664_update.c
	return 0;
}

int max32664_read_firmware_version(const struct device *dev, uint8_t *major, uint8_t *minor, uint8_t *patch)
{
	uint8_t response[4];
	int ret;
	
	if (major == NULL || minor == NULL || patch == NULL) {
		return -EINVAL;
	}
	
	LOG_DBG("Reading MAX32664 firmware version...");
	
	/* Read firmware version: Family 0xFF, Index 0x03 */
	ret = bootloader_i2c_command(dev, FAMILY_IDENTITY, IDENTITY_IDX_FW_VERSION, NULL, 0, response, 4, 10);
	if (ret) {
		LOG_ERR("Failed to read firmware version: %d", ret);
		return ret;
	}
	
	/* Response format: [status, major, minor, patch] */
	*major = response[0];
	*minor = response[1];
	*patch = response[2];
	
	LOG_INF("MAX32664 Firmware Version: %u.%u.%u", *major, *minor, *patch);
	
	return 0;
}

int max32664_enter_bootloader(const struct device *dev)
{
	struct max32664_bootloader_io io;
	uint8_t data = OP_MODE_BOOTLOADER;  /* Bootloader mode */
	uint8_t status;
	uint8_t response[8];
	int ret;
	uint32_t t_gpio_begin_ms = 0;
	uint32_t t_rstn_rise_ms = 0;
	uint32_t t_bl_ready_ms = 0;
	uint32_t t_latch_done_ms = 0;
	bool used_gpio = false;

	ret = max32664_get_bootloader_io(dev, &io);
	if (ret) {
		LOG_ERR("Failed to get MAX32664 transport interface: %d", ret);
		return ret;
	}

	LOG_INF("=== Step 1: Enter bootloader mode ===");

	max32664_bus_lock(dev);

	/* GPIO entry (ADI UG p.17) then mandatory software latch 0x01 0x00 0x08
	 * within ~780 ms of BL readiness, or a valid app exits BL automatically. */
	if (io.rstn_gpio.port != NULL && io.int_gpio.port != NULL) {
		used_gpio = true;
		t_gpio_begin_ms = k_uptime_get_32();
		LOG_INF("BL: GPIO entry begin t=%u ms", t_gpio_begin_ms);

		/* RSTN low ≥10 ms; MFIO low ≥1 ms before RSTN rise.
		 * DT: GPIO_ACTIVE_LOW → logical 1 = phys LOW. */
		gpio_pin_set_dt(&io.rstn_gpio, 1);
		k_msleep(10);

		gpio_pin_set_dt(&io.int_gpio, 1);
		k_msleep(1);

		gpio_pin_set_dt(&io.rstn_gpio, 0);
		t_rstn_rise_ms = k_uptime_get_32();
		LOG_INF("BL: RSTN released t=%u ms", t_rstn_rise_ms);

		/* UG: +50 ms after RSTN rise → device is in bootloader mode. */
		k_msleep(50);
		t_bl_ready_ms = k_uptime_get_32();
		LOG_INF("BL: ready (RSTN+50ms) t=%u ms", t_bl_ready_ms);

		/* Latch NOW — do not burn the 780 ms window on MFIO release /
		 * version queries. Table 9: 0x01 0x00 0x08 immediately. */
		ret = bootloader_i2c_command(dev, FAMILY_CONFIG, CONFIG_IDX_OP_MODE,
					     &data, 1, &status, 1, 10);
		t_latch_done_ms = k_uptime_get_32();
		{
			uint32_t from_ready = t_latch_done_ms - t_bl_ready_ms;
			uint32_t from_rstn = t_latch_done_ms - t_rstn_rise_ms;

			LOG_INF("BL: latch 0x01 0x00 0x08 done t=%u ms "
				"(+%u ms from BL-ready, +%u ms from RSTN rise) "
				"ret=%d status=0x%02x",
				t_latch_done_ms, from_ready, from_rstn, ret,
				(ret == 0) ? status : 0xFF);
			if (from_ready > 780U) {
				LOG_ERR("BL: LATCH OUTSIDE ~780 ms WINDOW "
					"(from BL-ready=%u ms) — app may have jumped",
					from_ready);
			} else {
				LOG_INF("BL: latch within 780 ms window (OK)");
			}
		}

		/* Release MFIO after latch (host may later use it as IRQ). */
		gpio_pin_set_dt(&io.int_gpio, 0);

		if (ret) {
			LOG_ERR("BL: software latch failed: %d", ret);
			goto out_unlock;
		}
	} else {
		LOG_WRN("No GPIO control - I2C-only bootloader entry (0x01 0x00 0x08)");
		t_bl_ready_ms = k_uptime_get_32();
		ret = bootloader_i2c_command(dev, FAMILY_CONFIG, CONFIG_IDX_OP_MODE,
					     &data, 1, &status, 1, 50);
		t_latch_done_ms = k_uptime_get_32();
		LOG_INF("BL: I2C latch t=%u ms elapsed=%u ms ret=%d",
			t_latch_done_ms, t_latch_done_ms - t_bl_ready_ms, ret);
		if (ret) {
			LOG_ERR("Failed to enter bootloader: %d", ret);
			goto out_unlock;
		}
		k_msleep(350);
	}

	/* Step 2: Verify bootloader mode */
	LOG_INF("=== Step 2: Read/Verify mode ===");

	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_OUTPUT_MODE, OUTPUT_MODE_IDX,
						 NULL, 0, &status, 2, 10,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Read/Verify mode");
	if (ret) {
		LOG_ERR("FAILED to read mode: %d (gpio_entry=%d)", ret, used_gpio);
		goto out_unlock;
	}
	if (status != 0x08) {
		LOG_ERR("FAILED: Expected mode 0x08, got 0x%02x (gpio_entry=%d)",
			status, used_gpio);
		ret = -EIO;
		goto out_unlock;
	}
	LOG_INF("SUCCESS: Device is in bootloader mode (0x%02X) t=%u ms",
		status, k_uptime_get_32());
	
	/* Step 3: Get ID and MCU type */
	LOG_INF("=== Step 3: Get ID and MCU type ===");
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_IDENTITY, IDENTITY_IDX_MCU_TYPE,
						 NULL, 0, response, 2, 10,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Get MCU ID");
	if (ret) {
		LOG_WRN("Get ID failed: %d (may not be critical)", ret);
	} else {
		LOG_INF("SUCCESS: MCU ID = 0x%02X", response[0]);
	}
	
	/* Step 4: Read bootloader firmware version */
	LOG_INF("=== Step 4: Read bootloader version ===");
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_BOOTLOADER_INFO, BL_INFO_IDX_VERSION,
						 NULL, 0, response, 4, 10,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Get bootloader version");
	if (ret) {
		LOG_WRN("Get bootloader version failed: %d (may not be critical)", ret);
	} else {
		LOG_INF("SUCCESS: Bootloader Version = %u.%u.%u", response[0], response[1], response[2]);
	}
	
	/* Step 5: Read bootloader page size */
	LOG_INF("=== Step 5: Read bootloader page size ===");
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_BOOTLOADER_INFO, BL_INFO_IDX_PAGE_SIZE,
						 NULL, 0, response, 3, 10,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Get bootloader page size");
	if (ret) {
		LOG_WRN("Get bootloader info failed: %d (may not be critical)", ret);
	} else {
		uint16_t bl_page_size = ((uint16_t)response[0] << 8) | response[1];
		LOG_INF("SUCCESS: Bootloader page size = %u bytes (0x%02X 0x%02X)",
			bl_page_size, response[0], response[1]);
		if (bl_page_size != MSBL_PAGE_DATA_SIZE) {
			LOG_WRN("Page size mismatch: bootloader reports %u, expected %u",
				bl_page_size, MSBL_PAGE_DATA_SIZE);
		}
	}

	ret = 0;

out_unlock:
	max32664_bus_unlock(dev);
	return ret;
}

int max32664_exit_bootloader(const struct device *dev)
{
	uint8_t data = OP_MODE_APPLICATION;  /* Application mode */
	uint8_t status = 0xFF;
	uint8_t mode = 0xFF;
	int ret;

	LOG_INF("=== Exit BL: enter application mode t=%u ms ===", k_uptime_get_32());

	/* Family 0x01, Index 0x00, Data 0x00 */
	ret = bootloader_i2c_command(dev, FAMILY_CONFIG, CONFIG_IDX_OP_MODE, &data, 1, &status, 1, 50);
	if (ret) {
		LOG_WRN("Exit bootloader command failed: %d (may be normal)", ret);
	} else {
		LOG_INF("Exit BL command status=0x%02x", status);
	}

	/* Wait for reboot (AN6924 Variant C ~1.8 s) */
	k_msleep(2000);

	ret = bootloader_i2c_command(dev, FAMILY_OUTPUT_MODE, OUTPUT_MODE_IDX,
				     NULL, 0, &mode, 2, 10);
	if (ret) {
		LOG_WRN("Post-exit mode read failed: %d (app may still be starting)", ret);
	} else {
		LOG_INF("Post-exit mode=0x%02x (expect 0x00 application) t=%u ms",
			mode, k_uptime_get_32());
	}

	LOG_INF("MAX32664 should now be in application mode");
	return 0;
}

