DMSurya/Nisense_Surya/NiSense-main/src/sensors/max32664_update.c
int max32664_msbl_sanity_check(const uint8_t *msbl, size_t msbl_len, uint8_t *num_pages_out)
{
	uint8_t pages;
	size_t need;

	if (msbl == NULL || msbl_len < MSBL_HEADER_SIZE) {
		return -EINVAL;
	}

	pages = msbl[MSBL_OFFSET_NUM_PAGES];
	if (pages == 0 || pages > MAX32664_MAX_PAGES) {
		return -EINVAL;
	}

	need = MSBL_HEADER_SIZE + ((size_t)pages * MSBL_PAGE_SIZE);
	if (msbl_len < need) {
		LOG_ERR("MSBL truncated: have %zu need %zu (%u pages)", msbl_len, need, pages);
		return -EINVAL;
	}

	if (num_pages_out) {
		*num_pages_out = pages;
	}
	return 0;
}

static void parse_version_from_name(const char *name_hint,
				    struct max32664_firmware_info *fw_info)
{
	fw_info->ver_major = 0;
	fw_info->ver_minor = 0;
	fw_info->ver_patch = 0;
	if (!name_hint) {
		return;
	}

	const char *base = strrchr(name_hint, '/');
	const char *ver = strrchr(base ? base : name_hint, '_');

	if (!ver) {
		return;
	}

	char *end;
	unsigned long v;

	ver++;
	v = strtoul(ver, &end, 10);
	if (end != ver && *end == '.') {
		fw_info->ver_major = (uint8_t)v;
		ver = end + 1;
		v = strtoul(ver, &end, 10);
		if (end != ver && *end == '.') {
			fw_info->ver_minor = (uint8_t)v;
			ver = end + 1;
			v = strtoul(ver, &end, 10);
			if (end != ver) {
				fw_info->ver_patch = (uint8_t)v;
			}
		}
	}
}

static int parse_msbl_header_buf(const uint8_t *msbl, size_t msbl_len,
				 const char *name_hint,
				 struct max32664_firmware_info *fw_info)
{
	int ret = max32664_msbl_sanity_check(msbl, msbl_len, &fw_info->num_pages);

	if (ret) {
		return ret;
	}

	memcpy(fw_info->iv_bytes, &msbl[MSBL_OFFSET_IV], 11);
	memcpy(fw_info->auth_bytes, &msbl[MSBL_OFFSET_AUTH], 16);
	parse_version_from_name(name_hint, fw_info);

	LOG_INF("=== MSBL Firmware Info ===");
	LOG_INF("Number of pages: %u", fw_info->num_pages);
	LOG_INF("Image size: %zu bytes", msbl_len);
	if (fw_info->ver_major || fw_info->ver_minor || fw_info->ver_patch) {
		LOG_INF("New firmware version: v%u.%u.%u (from name)",
			fw_info->ver_major, fw_info->ver_minor, fw_info->ver_patch);
	}
	LOG_HEXDUMP_INF(fw_info->iv_bytes, 11, "Initialization Vector:");
	LOG_HEXDUMP_INF(fw_info->auth_bytes, 16, "Authentication Bytes:");
	LOG_INF("=========================");
	return 0;
}

int max32664_update_firmware_buf(const struct device *dev,
				 const uint8_t *msbl, size_t msbl_len,
				 const char *name_hint,
				 max32664_update_progress_cb progress_cb,
				 void *user_data)
{
	struct max32664_firmware_info fw_info;
	struct update_guardrails_state guardrails = {0};
	uint8_t cmd_buf[32];
	uint8_t response[4];
	uint8_t old_major = 0, old_minor = 0, old_patch = 0;
	uint8_t new_major = 0, new_minor = 0, new_patch = 0;
	uint32_t page_num = 0;
	uint32_t total_pages;
	uint8_t *tx_buf = NULL;
	int ret;

	LOG_INF("Starting MAX32664 firmware update from buffer (%zu bytes)", msbl_len);

	ret = parse_msbl_header_buf(msbl, msbl_len, name_hint, &fw_info);
	if (ret) {
		return ret;
	}

	total_pages = fw_info.num_pages;

	/* Provenance before any BL entry / erase (Maxim auth still applies later). */
	{
		size_t policy_len = MSBL_HEADER_SIZE +
				    ((size_t)fw_info.num_pages * MSBL_PAGE_SIZE);

		if (policy_len > msbl_len) {
			policy_len = msbl_len;
		}
		ret = max32664_msbl_policy_check(msbl, policy_len, name_hint,
						 fw_info.ver_major, fw_info.ver_minor,
						 fw_info.ver_patch);
		if (ret) {
			LOG_ERR("MSBL rejected by host provenance policy: %d", ret);
			return ret;
		}
	}

	if (max32664_read_firmware_version(dev, &old_major, &old_minor, &old_patch) != 0) {
		LOG_WRN("Could not read old firmware version (will show 0.0.0)");
	}

	activate_update_guardrails(&guardrails, dev);

	/* Session lock across enter → program → exit so feeder/sampling
	 * cannot slip between page commands. Nested locks in helpers are OK. */
	max32664_bus_lock(dev);

	ret = max32664_enter_bootloader(dev);
	if (ret) {
		goto exit_with_guardrails;
	}

	LOG_INF("=== Step 6: Set number of pages ===");
	cmd_buf[0] = 0x00;
	cmd_buf[1] = fw_info.num_pages;
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_BOOTLOADER, BOOTLOADER_SET_NUM_PAGES,
						 cmd_buf, 2, response, 1, 50,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Set number of pages");
	LOG_INF("BL: set_num_pages ret=%d t=%u", ret, k_uptime_get_32());
	if (ret) {
		goto exit_with_guardrails;
	}

	LOG_INF("=== Step 7: Set Initialization Vector ===");
	memcpy(cmd_buf, fw_info.iv_bytes, 11);
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_BOOTLOADER, BOOTLOADER_SET_IV,
						 cmd_buf, 11, response, 1, 500,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Set Initialization Vector");
	LOG_INF("BL: set_IV ret=%d t=%u", ret, k_uptime_get_32());
	if (ret) {
		goto exit_with_guardrails;
	}

	LOG_INF("=== Step 8: Set Authentication bytes ===");
	memcpy(cmd_buf, fw_info.auth_bytes, 16);
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_BOOTLOADER, BOOTLOADER_SET_AUTH,
						 cmd_buf, 16, response, 1, 500,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Set Authentication bytes");
	LOG_INF("BL: set_AUTH ret=%d t=%u", ret, k_uptime_get_32());
	if (ret) {
		goto exit_with_guardrails;
	}

	LOG_INF("=== Step 9: Erase application flash (CMD_DELAY=%d ms) ===",
		CONFIG_MAX32664_UPDATE_ERASE_CMD_DELAY_MS);
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_BOOTLOADER, BOOTLOADER_ERASE_APP,
						 NULL, 0, response, 1,
						 CONFIG_MAX32664_UPDATE_ERASE_CMD_DELAY_MS,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Erase application flash");
	LOG_INF("BL: erase ret=%d t=%u", ret, k_uptime_get_32());
	if (ret) {
		goto exit_with_guardrails;
	}

	if (CONFIG_MAX32664_UPDATE_ERASE_POST_SETTLE_MS > 0) {
		k_msleep(CONFIG_MAX32664_UPDATE_ERASE_POST_SETTLE_MS);
	}

	tx_buf = k_malloc(PAGE_TX_TOTAL);
	if (!tx_buf) {
		ret = -ENOMEM;
		goto exit_with_guardrails;
	}

	while (page_num < total_pages) {
		size_t off = MSBL_HEADER_SIZE + ((size_t)page_num * MSBL_PAGE_SIZE);

		memcpy(&tx_buf[2], &msbl[off], MAX32664_PAGE_SIZE);
		memcpy(&tx_buf[2 + MAX32664_PAGE_SIZE],
		       &msbl[off + MAX32664_PAGE_SIZE], MSBL_PAGE_CHECKSUM_SIZE);

		LOG_INF("--- Page %u/%u t=%u ---", page_num + 1, total_pages,
			k_uptime_get_32());
		ret = write_page_to_bootloader(dev, tx_buf);
		if (ret) {
			LOG_ERR("BL: page %u write failed: %d", page_num + 1, ret);
			goto exit_with_guardrails;
		}
		if (page_num == 0U) {
			LOG_INF("BL: first page write OK t=%u", k_uptime_get_32());
		}

		page_num++;
		if (progress_cb) {
			progress_cb(page_num, total_pages, user_data);
		}
	}

