DMSurya/Nisense_Surya/NiSense-main/src/sensors/max32664_update.c
#if IS_ENABLED(CONFIG_MAX32664_UPDATE_SEND_FLASH_APP)
	LOG_INF("=== Step 11: Finalize flashed application (0x80 0x06) ===");
	ret = bootloader_i2c_command_with_retry(dev,
						 FAMILY_BOOTLOADER, BOOTLOADER_FLASH_APP,
						 NULL, 0, response, 1, 1400,
						 BOOTLOADER_BUSY_RETRIES,
						 BOOTLOADER_BUSY_RETRY_DELAY_MS,
						 "Finalize flashed application");
	LOG_INF("BL: finalize ret=%d t=%u", ret, k_uptime_get_32());
	if (ret) {
		goto exit_with_guardrails;
	}
#else
	LOG_INF("=== Step 11: Finalize skipped (CONFIG_MAX32664_UPDATE_SEND_FLASH_APP=n; UG Table 9) ===");
#endif

	LOG_INF("Firmware update complete (%u pages written) t=%u",
		page_num, k_uptime_get_32());
	ret = 0;

exit_with_guardrails:
	if (tx_buf) {
		k_free(tx_buf);
	}

	{
		int exit_ret = max32664_exit_bootloader(dev);

		if (ret == 0 && exit_ret != 0) {
			ret = exit_ret;
		}
	}

	max32664_bus_unlock(dev);
	deactivate_update_guardrails(&guardrails);

	if (ret == 0) {
		k_msleep(1000);
		if (max32664_read_firmware_version(dev, &new_major, &new_minor,
						   &new_patch) == 0) {
			LOG_INF("*** Firmware Update Summary ***");
			LOG_INF("Old Version: v%u.%u.%u", old_major, old_minor, old_patch);
			LOG_INF("New Version: v%u.%u.%u", new_major, new_minor, new_patch);
		}
	}

	return ret;
}

int max32664_update_firmware_from_app_partition(const struct device *dev,
						max32664_update_progress_cb progress_cb,
						void *user_data)
{
	const uint8_t *msbl = (const uint8_t *)APP_DATA_RESOURCE_MMAP_ADDR;
	uint8_t pages = 0;
	size_t len;
	int ret;

	ret = max32664_msbl_sanity_check(msbl, APP_DATA_PARTITION_SIZE, &pages);
	if (ret) {
		LOG_ERR("No valid .msbl in QSPI app partition: %d", ret);
		return ret;
	}

	len = MSBL_HEADER_SIZE + ((size_t)pages * MSBL_PAGE_SIZE);
	LOG_INF("Flashing hub from QSPI app partition (%u pages, %zu bytes)", pages, len);
	return max32664_update_firmware_buf(dev, msbl, len, "app_partition.msbl",
					    progress_cb, user_data);
}

int max32664_update_firmware(const struct device *dev, const char *firmware_path,
			     max32664_update_progress_cb progress_cb, void *user_data)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(firmware_path);
	ARG_UNUSED(progress_cb);
	ARG_UNUSED(user_data);
	LOG_ERR("Path-based MSBL update removed (/NAND: FatFS gone). "
		"Use max32664_update_firmware_buf() or _from_app_partition()");
	return -ENOTSUP;
}

